Autodesk.Revit.DB.Mechanical.ZoneEquipment.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Mechanical.AnalyticalSystemDomain,System.String)
Creates a new zone equipment
document:
The document where the new element will be created.
systemDomain:
The system domain of zone equipment.
name:
The name of new zone equipment. The actual name may be post-fixed if already exists.
Returns:
The newly created zone equipment.
Throws Autodesk.Revit.Exceptions.ArgumentException:
name cannot include prohibited characters, such as "{, }, [, ], |, ;, less-than sign, greater-than sign, ?, `, ~".
-or-
name is an empty string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2022